/* Задание #1: P(x) = 9.09x^8 + 9.09x^4 + 9.09x^2
*  Задание #2: P(x) = 8.243x^24 + 725.6x^20 + 186.41x^16
*  Задание #3: Перемножить результаты х1 и х2.
*  Автор: Фролов Александр Эдуардович
*  Группа: 2302
*  Версия: 1.1
*  Дата: начало: 11.09.2022 окончание: 14.09.2022
*/

#include <iostream>
#include <stdio.h>

using namespace std;

void main(void)
{
	setlocale(LC_CTYPE, "rus"); // русский язык в консоли
	float x, P, P1, P2, y, n;
	printf("%s", "Автор: Фролов Александр Эдуардович \n\n");
	printf("%s", "Введите х: ");
	scanf_s("%f", &x);

	// Задание #1.
	printf("%s%s", "\n Задание #1.\n",
		"P(x) = 9.09x^8 + 9.09x^4 + 9.09x^2 \n");
	n = 9.09;
	y = x * x;
	P1 = n * y;
	printf("%s%.15f%s", "1й шаг: Р = ", P1, "\n");
	P1 = (P1 * y) + n;
	printf("%s%.15f%s", "2й шаг: Р = ", P1, "\n");
	P1 = (P1 * y) + n;
	printf("%s%.15f%s", "3й шаг: Р = ", P1, "\n");
	P1 = P1 * y;
	printf("%s%.15f%s", "4й шаг: Р = ", P1, "\n");
	printf("%s%.3f%s%.15f%s", "Результат для x = ", x, ": \n", P1, "\n\n");

	// Задание #2.
	printf("%s%s", "Задание #2.\n",
		"P(x) = 8.243x^24 + 725.6x^20 + 186.41x^16 \n");
	y = x * x * x * x;
	P2 = (8.243 * y * y * y * y * y * y) + (725.6 * y * y * y * y * y) - (186.41 * y * y * y * y);
	printf("%s%.3f%s%.15f%s", "Результат для x = ", x, ": \n", P2, "\n\n");

	// Задание #3.
	printf("%s%s", "Задание #3. \n",
		"Перемножить результаты х1 и х2. \n");
	P = P1 * P2;
	printf("%s%.6f%s", "Результат: \n", P, "\n");
}